espressif/esp-idf/components/soc/esp32h4/include/rev1/soc/clkrst_reg.h
/*
 * SPDX-FileCopyrightText: 2017-2021 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_CLKRST_REG_H_
#define _SOC_CLKRST_REG_H_

#include "soc/soc.h"

#ifdef __cplusplus
extern "C" {
#endif
#define SYSTEM_SYSCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x0000)
/* SYSTEM_SOC_CLK_SEL : R/W ;bitpos:[17:16] ;default: 2'h3 ; */
/*description: */
#define SYSTEM_SOC_CLK_SEL  0x00000003
#define SYSTEM_SOC_CLK_SEL_M  ((SYSTEM_SOC_CLK_SEL_V)<<(SYSTEM_SOC_CLK_SEL_S))
#define SYSTEM_SOC_CLK_SEL_V  0x3
#define SYSTEM_SOC_CLK_SEL_S  16
/* SYSTEM_SPLL_FREQ : RO ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_SPLL_FREQ  0x000000FF
#define SYSTEM_SPLL_FREQ_M  ((SYSTEM_SPLL_FREQ_V)<<(SYSTEM_SPLL_FREQ_S))
#define SYSTEM_SPLL_FREQ_V  0xFF
#define SYSTEM_SPLL_FREQ_S  8
/* SYSTEM_XTAL_FREQ : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_CLK_XTAL_FREQ  0x000000FF
#define SYSTEM_CLK_XTAL_FREQ_M  ((SYSTEM_CLK_XTAL_FREQ_V)<<(SYSTEM_CLK_XTAL_FREQ_S))
#define SYSTEM_CLK_XTAL_FREQ_V  0xFF
#define SYSTEM_CLK_XTAL_FREQ_S  0

#define SYSTEM_CPUCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x0004)
/* SYSTEM_CPU_DIV_DENOMINATOR : R/W ;bitpos:[21:16] ;default: 6'h0 ; */
/*description: */
#define SYSTEM_CPU_DIV_DENOMINATOR  0x0000003F
#define SYSTEM_CPU_DIV_DENOMINATOR_M  ((SYSTEM_CPU_DIV_DENOMINATOR_V)<<(SYSTEM_CPU_DIV_DENOMINATOR_S))
#define SYSTEM_CPU_DIV_DENOMINATOR_V  0x3F
#define SYSTEM_CPU_DIV_DENOMINATOR_S  16
/* SYSTEM_CPU_DIV_NUMERATOR : R/W ;bitpos:[13:8] ;default: 6'h0 ; */
/*description: */
#define SYSTEM_CPU_DIV_NUMERATOR  0x0000003F
#define SYSTEM_CPU_DIV_NUMERATOR_M  ((SYSTEM_CPU_DIV_NUMERATOR_V)<<(SYSTEM_CPU_DIV_NUMERATOR_S))
#define SYSTEM_CPU_DIV_NUMERATOR_V  0x3F
#define SYSTEM_CPU_DIV_NUMERATOR_S  8
/* SYSTEM_CPU_DIV_NUM : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_CPU_DIV_NUM  0x000000FF
#define SYSTEM_CPU_DIV_NUM_M  ((SYSTEM_CPU_DIV_NUM_V)<<(SYSTEM_CPU_DIV_NUM_S))
#define SYSTEM_CPU_DIV_NUM_V  0xFF
#define SYSTEM_CPU_DIV_NUM_S  0

#define SYSTEM_PRE_DIV_CNT  SYSTEM_CPU_DIV_NUM
#define SYSTEM_PRE_DIV_CNT_M  SYSTEM_CPU_DIV_NUM_M
#define SYSTEM_PRE_DIV_CNT_V  SYSTEM_CPU_DIV_NUM_V
#define SYSTEM_PRE_DIV_CNT_S  SYSTEM_CPU_DIV_NUM_S

#define SYSTEM_BUSCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x0008)
/* SYSTEM_AHB_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_AHB_DIV_NUM  0x000000FF
#define SYSTEM_AHB_DIV_NUM_M  ((SYSTEM_AHB_DIV_NUM_V)<<(SYSTEM_AHB_DIV_NUM_S))
#define SYSTEM_AHB_DIV_NUM_V  0xFF
#define SYSTEM_AHB_DIV_NUM_S  8
/* SYSTEM_APB_DIV_NUM : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define SYSTEM_APB_DIV_NUM  0x000000FF
#define SYSTEM_APB_DIV_NUM_M  ((SYSTEM_APB_DIV_NUM_V)<<(SYSTEM_APB_DIV_NUM_S))
#define SYSTEM_APB_DIV_NUM_V  0xFF
#define SYSTEM_APB_DIV_NUM_S  0

#define SYSTEM_MODCLK_CONF_REG          (DR_REG_CLKRST_BASE + 0x000C)
/* SYSTEM_MODEM_CLK_SEL : R/W ;bitpos:[1:0] ;default: 1'h1 ; */
/*description: */
#define SYSTEM_MODEM_CLK_SEL  0x00000003
#define SYSTEM_MODEM_CLK_SEL_M  ((SYSTEM_MODEM_CLK_SEL_V)<<(SYSTEM_MODEM_CLK_SEL_S))
#define SYSTEM_MODEM_CLK_SEL_V  0x3
#define SYSTEM_MODEM_CLK_SEL_S  0

#define SYSTEM_CLK_OUT_EN_REG          (DR_REG_CLKRST_BASE + 0x0010)
/* SYSTEM_CLK_RFADC_OEN : R/W ;bitpos:[12] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_RFADC_OEN  (BIT(12))
#define SYSTEM_CLK_RFADC_OEN_M  (BIT(12))
#define SYSTEM_CLK_RFADC_OEN_V  0x1
#define SYSTEM_CLK_RFADC_OEN_S  12
/* SYSTEM_CLK_RFDAC_OEN : R/W ;bitpos:[11] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_RFDAC_OEN  (BIT(11))
#define SYSTEM_CLK_RFDAC_OEN_M  (BIT(11))
#define SYSTEM_CLK_RFDAC_OEN_V  0x1
#define SYSTEM_CLK_RFDAC_OEN_S  11
/* SYSTEM_CLK_XTAL_OEN : R/W ;bitpos:[10] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_XTAL_OEN  (BIT(10))
#define SYSTEM_CLK_XTAL_OEN_M  (BIT(10))
#define SYSTEM_CLK_XTAL_OEN_V  0x1
#define SYSTEM_CLK_XTAL_OEN_S  10
/* SYSTEM_CLK_SPLL_OEN : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_SPLL_OEN  (BIT(9))
#define SYSTEM_CLK_SPLL_OEN_M  (BIT(9))
#define SYSTEM_CLK_SPLL_OEN_V  0x1
#define SYSTEM_CLK_SPLL_OEN_S  9
/* SYSTEM_CLK_CPU_OEN : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_CPU_OEN  (BIT(8))
#define SYSTEM_CLK_CPU_OEN_M  (BIT(8))
#define SYSTEM_CLK_CPU_OEN_V  0x1
#define SYSTEM_CLK_CPU_OEN_S  8
/* SYSTEM_CLK_AHB_OEN : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_AHB_OEN  (BIT(7))
#define SYSTEM_CLK_AHB_OEN_M  (BIT(7))
#define SYSTEM_CLK_AHB_OEN_V  0x1
#define SYSTEM_CLK_AHB_OEN_S  7
/* SYSTEM_CLK_APB_OEN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_APB_OEN  (BIT(6))
#define SYSTEM_CLK_APB_OEN_M  (BIT(6))
#define SYSTEM_CLK_APB_OEN_V  0x1
#define SYSTEM_CLK_APB_OEN_S  6
/* SYSTEM_CLK_32M_BT_OEN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_32M_BT_OEN  (BIT(5))
#define SYSTEM_CLK_32M_BT_OEN_M  (BIT(5))
#define SYSTEM_CLK_32M_BT_OEN_V  0x1
#define SYSTEM_CLK_32M_BT_OEN_S  5
/* SYSTEM_CLK_16M_BT_OEN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_16M_BT_OEN  (BIT(4))
#define SYSTEM_CLK_16M_BT_OEN_M  (BIT(4))
#define SYSTEM_CLK_16M_BT_OEN_V  0x1
#define SYSTEM_CLK_16M_BT_OEN_S  4
/* SYSTEM_CLK_8M_BT_OEN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_CLK_8M_BT_OEN  (BIT(3))
#define SYSTEM_CLK_8M_BT_OEN_M  (BIT(3))
#define SYSTEM_CLK_8M_BT_OEN_V  0x1
#define SYSTEM_CLK_8M_BT_OEN_S  3

#define SYSTEM_MODEM_CLK_EN_REG          (DR_REG_CLKRST_BASE + 0x0014)
/* SYSTEM_DATA_DUMP_CLK_EN : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_DATA_DUMP_CLK_EN  (BIT(21))
#define SYSTEM_DATA_DUMP_CLK_EN_M  (BIT(21))
#define SYSTEM_DATA_DUMP_CLK_EN_V  0x1
#define SYSTEM_DATA_DUMP_CLK_EN_S  21
/* SYSTEM_RFADC_CLK_EN : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RFADC_CLK_EN  (BIT(20))
#define SYSTEM_RFADC_CLK_EN_M  (BIT(20))
#define SYSTEM_RFADC_CLK_EN_V  0x1
#define SYSTEM_RFADC_CLK_EN_S  20
/* SYSTEM_RFDAC_CLK_EN : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_RFDAC_CLK_EN  (BIT(19))
#define SYSTEM_RFDAC_CLK_EN_M  (BIT(19))
#define SYSTEM_RFDAC_CLK_EN_V  0x1
#define SYSTEM_RFDAC_CLK_EN_S  19
/* SYSTEM_BTLC_CLK_EN : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BTLC_CLK_EN  (BIT(18))
#define SYSTEM_BTLC_CLK_EN_M  (BIT(18))
#define SYSTEM_BTLC_CLK_EN_V  0x1
#define SYSTEM_BTLC_CLK_EN_S  18
/* SYSTEM_BLE_SEC_CLK_EN : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_CLK_EN  (BIT(17))
#define SYSTEM_BLE_SEC_CLK_EN_M  (BIT(17))
#define SYSTEM_BLE_SEC_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_CLK_EN_S  17
/* SYSTEM_BLE_SEC_BAH_CLK_EN : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_BAH_CLK_EN  (BIT(16))
#define SYSTEM_BLE_SEC_BAH_CLK_EN_M  (BIT(16))
#define SYSTEM_BLE_SEC_BAH_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_BAH_CLK_EN_S  16
/* SYSTEM_BLE_SEC_CCM_CLK_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_CCM_CLK_EN  (BIT(15))
#define SYSTEM_BLE_SEC_CCM_CLK_EN_M  (BIT(15))
#define SYSTEM_BLE_SEC_CCM_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_CCM_CLK_EN_S  15
/* SYSTEM_BLE_SEC_ECB_CLK_EN : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BLE_SEC_ECB_CLK_EN  (BIT(14))
#define SYSTEM_BLE_SEC_ECB_CLK_EN_M  (BIT(14))
#define SYSTEM_BLE_SEC_ECB_CLK_EN_V  0x1
#define SYSTEM_BLE_SEC_ECB_CLK_EN_S  14
/* SYSTEM_IEEE802154MAC_CLK_EN : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_IEEE802154MAC_CLK_EN  (BIT(13))
#define SYSTEM_IEEE802154MAC_CLK_EN_M  (BIT(13))
#define SYSTEM_IEEE802154MAC_CLK_EN_V  0x1
#define SYSTEM_IEEE802154MAC_CLK_EN_S  13
/* SYSTEM_IEEE802154BB_CLK_EN : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_IEEE802154BB_CLK_EN  (BIT(12))
#define SYSTEM_IEEE802154BB_CLK_EN_M  (BIT(12))
#define SYSTEM_IEEE802154BB_CLK_EN_V  0x1
#define SYSTEM_IEEE802154BB_CLK_EN_S  12
/* SYSTEM_COEX_CLK_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_COEX_CLK_EN  (BIT(11))
#define SYSTEM_COEX_CLK_EN_M  (BIT(11))
#define SYSTEM_COEX_CLK_EN_V  0x1
#define SYSTEM_COEX_CLK_EN_S  11
/* SYSTEM_I2CMST_CLK_EN : R/W ;bitpos:[10] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_I2CMST_CLK_EN  (BIT(10))
#define SYSTEM_I2CMST_CLK_EN_M  (BIT(10))
#define SYSTEM_I2CMST_CLK_EN_V  0x1
#define SYSTEM_I2CMST_CLK_EN_S  10
/* SYSTEM_I2C_CLK_EN : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_I2C_CLK_EN  (BIT(9))
#define SYSTEM_I2C_CLK_EN_M  (BIT(9))
#define SYSTEM_I2C_CLK_EN_V  0x1
#define SYSTEM_I2C_CLK_EN_S  9
/* SYSTEM_RW_BTMAC_CLK_EN : R/W ;bitpos:[8] ;default: 2'b0 ; */
/*description: */
#define SYSTEM_RW_BTMAC_CLK_EN  (BIT(8))
#define SYSTEM_RW_BTMAC_CLK_EN_M  (BIT(8))
#define SYSTEM_RW_BTMAC_CLK_EN_V  0x1
#define SYSTEM_RW_BTMAC_CLK_EN_S  8
/* SYSTEM_MACPWR_CLK_EN : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_MACPWR_CLK_EN  (BIT(7))
#define SYSTEM_MACPWR_CLK_EN_M  (BIT(7))
#define SYSTEM_MACPWR_CLK_EN_V  0x1
#define SYSTEM_MACPWR_CLK_EN_S  7
/* SYSTEM_EMAC_CLK_EN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_EMAC_CLK_EN  (BIT(6))
#define SYSTEM_EMAC_CLK_EN_M  (BIT(6))
#define SYSTEM_EMAC_CLK_EN_V  0x1
#define SYSTEM_EMAC_CLK_EN_S  6
/* SYSTEM_SDIO_CLK_EN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define SYSTEM_SDIO_CLK_EN  (BIT(5))
#define SYSTEM_SDIO_CLK_EN_M  (BIT(5))
#define SYSTEM_SDIO_CLK_EN_V  0x1
#define SYSTEM_SDIO_CLK_EN_S  5
/* SYSTEM_BTMAC_CLK_EN : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BTMAC_CLK_EN  (BIT(4))
#define SYSTEM_BTMAC_CLK_EN_M  (BIT(4))
#define SYSTEM_BTMAC_CLK_EN_V  0x1
#define SYSTEM_BTMAC_CLK_EN_S  4
/* SYSTEM_BT_CLK_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_BT_CLK_EN  (BIT(3))
#define SYSTEM_BT_CLK_EN_M  (BIT(3))
#define SYSTEM_BT_CLK_EN_V  0x1
#define SYSTEM_BT_CLK_EN_S  3
/* SYSTEM_MAC_CLK_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_MAC_CLK_EN  (BIT(2))
#define SYSTEM_MAC_CLK_EN_M  (BIT(2))
#define SYSTEM_MAC_CLK_EN_V  0x1
#define SYSTEM_MAC_CLK_EN_S  2
/* SYSTEM_FE_CLK_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_FE_CLK_EN  (BIT(1))
#define SYSTEM_FE_CLK_EN_M  (BIT(1))
#define SYSTEM_FE_CLK_EN_V  0x1
#define SYSTEM_FE_CLK_EN_S  1
/* SYSTEM_FE_CAL_CLK_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SYSTEM_FE_CAL_CLK_EN  (BIT(0))
#define SYSTEM_FE_CAL_CLK_EN_M  (BIT(0))
#define SYSTEM_FE_CAL_CLK_EN_V  0x1
#define SYSTEM_FE_CAL_CLK_EN_S  0

